app/views/dashboard/index.html.haml


    $("form#new-item").submit(function(event){
      event.preventDefault();

      var action = $(this).attr('action');
      var method = $(this).attr('method');

      var description = $(this).find('#description').val();
      var title = $(this).find('#title').val();

       $.ajax({
        method: method,
        url: action,
        data: { item: {title: title, description: description}}
      }).done(function( data ) {
          debugger;
          closeModal();
          var html = "<li id=" + data.id + "><div class='item'><p>" + data.title + "</p><button class='delete' id=" + data.id + ">Delete</button></div></li>";

          $('ul.items').append(html);
        });

---
SELECT "items".* FROM "items"