app/controllers/items_controller.rb

INSERT INTO "items" ("title", "description", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ""], ["description", ""], ["image", "room2.jpeg"], ["created_at", "2016-01-19 02:05:16.983683"], ["updated_at", "2016-01-19 02:05:16.983683"]]
---
  def create
    @item = Item.create(item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 112]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 112]]
---
  def destroy
    if params[:item][:id]
      @id = params[:item][:id]
      @item = Item.find(@id)
    end

    if @item
      @item.delete